const shows = {
  "Don Giovanni": {
    name: "Ντον Τζοβάννι",
    composer: "Βόλφγκανγκ Αμαντέους Μότσαρτ",
    libretto: "Λορένζο ντα Πόντε",
    production:
      "Συμπαραγωγή με την Όπερα του Γκαίτεμποργκ (Σουηδία) και τη Βασιλική Όπερα της Δανίας",
    img_src: "newimg/ντον3.jpg",
    description: `Η νέα παραγωγή του Ντον Τζοβάννι του Μότσαρτ αποτελεί μια μεγάλη διεθνή συμπαραγωγή της Εθνικής Λυρικής Σκηνής με δύο σημαντικά βορειοευρωπαϊκά λυρικά θέατρα, την Όπερα του Γκαίτεμποργκ και τη Βασιλική Όπερα της Δανίας. Τη σκηνοθεσία υπογράφει ο διακεκριμένος σκηνοθέτης και καλλιτεχνικός διευθυντής της Βασιλικής Όπερας της Δανίας Τζων Φούλτζεϊμς. Η παραγωγή, μετά την αθηναϊκή πρεμιέρα του Δεκεμβρίου του 2021, θα παρουσιαστεί σε Γκαίτεμποργκ και Κοπεγχάγη. O Φούλτζεϊμς τοποθετεί τη δράση της όπερας σε ένα σημερινό ξενοδοχείο, έναν μικρόκοσμο μιας πόλης, έναν τόπο συνάντησης ανθρώπων, όπου το ιδιωτικό γίνεται δημόσιο και ο χρόνος παραμονής είναι περιορισμένος. Ο σκηνοθέτης σημειώνει: «Ο Ντον Τζοβάννι είναι μια όπερα που διαρκεί στον χρόνο επειδή είναι πολύπλευρη· έχει πολύ χιούμορ και σπουδαία θεατρικά σκηνικά, όλα ενταγμένα μέσα σε μια σκοτεινή ιστορία μυστηρίου για έναν αποπλανητή που κάποιος πρέπει να τον σταματήσει. Είναι ένα έργο για το πώς ζούμε μαζί στην κοινωνία και, όπως συμβαίνει πάντα με την όπερα, για το πώς αντιμετωπίζουμε τον θάνατο. Η κορύφωσή του έγκειται στον πολυαναμενόμενο θάνατο του ίδιου του Ντον Τζοβάννι, καθώς προτιμάει τον θάνατο, ακόμα και την κόλαση, από το να απαρνηθεί το ποιος είναι. Ο θάνατός του είναι μια έκφραση της τάξης που επανεπιβεβαιώνει την ισχύ της έναντι της αχαλίνωτης ελευθερίας που εκείνος αντιπροσωπεύει». Στον Ντον Τζοβάννι –ένα από τα ορόσημα του οπερατικού ρεπερτορίου– ο Μότσαρτ αποδίδει με τη μουσική του όλες τις όψεις της πορείας του ανθρώπου που τα βάζει με τον Θεό και παίρνει την τύχη του στα χέρια του.`,
    dates: [
      "2021-12-12",
      "2021-12-13",
      "2021-12-16",
      "2021-12-18",
      "2021-12-20",
      "2021-12-22",
      "2021-12-27",
      "2021-12-29",
    ],
    crew: {
      conductor: "Ντάνιελ Σμιθ",
      director: "Τζων Φούλτζεϊμς",
      "associate director": "Αϋλίν Μπόζοκ",
      sets: "Ντικ Μπερντ",

      umes: "Άνμαρι Γουντς",
      choreographer: "Μαξίν Μπρέιαμ",
      "lighting designer": "Φαμπιάνα Πιτσόλι",
      "video designer": "Ουίλ Ντιούκ",
      "programmer video": "Νταν Τρέντσαρντ",
      "chorus master": "Αγαθάγγελος Γεωργακάτος",
    },
    roles: {
      "Ντον Τζοβάννι": {
        "Τάσης Χριστογιαννόπουλος": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Διονύσης Σούρμπης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      "Ντόννα Άννα": {
        "Βασιλική Καραγιάννη": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Σιρανούς Τσαλικιάν": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      "Ντον Οττάβιο": {
        "Γιάννης Χριστόπουλος ": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Βασίλης Καβάγιας": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      Διοικητής: {
        "Πέτρος Μαγουλάς": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Αλέξανδρος Σταυρακάκης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      "Ντόννα Ελβίρα": {
        "Άννα Στυλιανάκη": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Άρτεμις Μπόγρη": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },

      "Ντον Πέντρο": {
        "Νίκος Κοτενίδης": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Γιώργος Ματθαιακάκης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },

      Λεπορέλλο: {
        "Τάσος Αποστόλου": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Χάρης Ανδριανός": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      Μαζέττο: {
        "Νίκος Κοτενίδης": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Γιώργος Ματθαιακάκης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      Tσερλίνα: {
        "Χρύσα Μαλιαμάνη": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Μιράντα Μακρυνιώτη": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      Χωρικοί: {
        "Τάσος Αποστόλου": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Χάρης Ανδριανός": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
        "Πέτρος Μαγουλάς": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Αλέξανδρος Σταυρακάκης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      "Νεαρές κοπέλες": {
        "Χρύσα Μαλιαμάνη": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Μιράντα Μακρυνιώτη": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
        "Άρτεμις Μπόγρη": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
      },
      Υπηρέτες: {
        "Τάσος Αποστόλου": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Χάρης Ανδριανός": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
      Μουσικοί: {
        "Πέτρος Μαγουλάς": [
          "2021-12-12",
          "2021-12-16",
          "2021-12-20",
          "2021-12-27",
        ],
        "Αλέξανδρος Σταυρακάκης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
        "Νίκος Κοτενίδης": [
          "2021-12-13",
          "2021-12-18",
          "2021-12-22",
          "2021-12-29",
        ],
      },
    },
  },

  "The Marriage of Figaro": {
    name: "Οι Γάμοι του Φίγκαρο",
    composer: "Βόλφγκανγκ Αμαντέους Μότσαρτ",
    libretto: "Λορένζο ντα Πόντε",
    production: "Εθνική Λυρική Σκηνή",
    img_src: "newimg/figaro4.jpg",
    description: ` Έχουν περάσει τρία χρόνια από τότε που ο Φίγκαρο κατάφερε να παντρέψει τον Κόμη Αλμαβίβα με τη Ροζίνα και τώρα είναι η σειρά του να παντρευτεί τη Σουζάννα, μέλος του υπηρετικού τους προσωπικού, όπως και ο ίδιος. Ωστόσο ο Κόμης έχει αρχίσει να βαριέται τον έγγαμο βίο και προσπαθεί να εκμεταλλευτεί το προνόμιο της «πρώτης νύχτας» σύμφωνα με το οποίο ένας άρχοντας μπορεί να κοιμηθεί με μια υπηρέτριά του την πρώτη νύχτα του γάμου της. Οι μηχανορραφίες του Κόμη όμως αποκαλύπτονται, ο Φίγκαρο με τη Σουζάννα παντρεύονται και ο ίδιος ο Κόμης υποχρεώνεται να ζητήσει συγχώρεση από τη σύζυγό του για την ανάρμοστη αυτή συμπεριφορά, δίνοντας στο έργο ένα αίσιο τέλος.Αναμφισβήτητα οι Γάμοι του Φίγκαρο αποπνέουν την υποβόσκουσα κοινωνική αναστάτωση που θα οδηγούσε σε πολύ λίγα χρόνια στην έκρηξη της Γαλλικής Επανάστασης. Ο ίδιος ο Ναπολέοντας αργότερα θα περιέγραφε το έργο ως την «Επανάσταση εν δράσει». Ο Μότσαρτ και ο Ντα Πόντε, στην προσπάθειά τους να αποφύγουν προβλήματα με τις αρχές λογοκρισίας, τροποποίησαν σημαντικά το θεατρικό έργο δίνοντας μεγαλύτερο βάρος στο ερωτικό στοιχείο και λιγότερο στο θέμα της κοινωνικής σύγκρουσης. Χαρακτηριστικό παράδειγμα ο μονόλογος του Φίγκαρο, όπου, ενώ στο θεατρικό κείμενο κατακρίνεται η κληρονομημένη αριστοκρατική καταγωγή και ουσιαστικά τίθεται στο στόχαστρο της κριτικής η αριστοκρατική τάξη, στην όπερα προσαρμόζεται σε κριτική για τις άπιστες γυναίκες…Οι Γάμοι του Φίγκαρο, πέρα από τα ενδογενή επαναστατικά μηνύματα σε συνδυασμό με το ερωτικό στοιχείο που αναδύεται από τη γοητευτική και τρυφερή μουσική του Μότσαρτ, αποτελούν τομή στην ιστορία της όπερας, καθώς πρωταγωνιστές δεν είναι πλέον θεοί, μυθικοί ήρωες ή εξωτικά πρόσωπα αλλά άνθρωποι της καθημερινότητας: άρχοντες και υπηρέτες. `,
    dates: ["2020-5-13", "2021-12-15", "2021-12-17"],

    crew: {
      conductor: "Βασίλης Χριστόπουλος",
      director: "Αλέξανδρος Ευκλείδης",
      dramaturgy: "Αγγέλα-Κλεοπάτρα Σαρόγλου",
      sets: "Γιάννης Κατρανίτσας",
      costumes: "Ιωάννα Τσάμη",
      "lighting designer": "Μελίνα Μάσχα",
      "chorus master": "Αγαθάγγελος Γεωργακάτος",
    },
    roles: {
      "Κόμης Αλμαβίβα": {
        "Δημήτρης Πλατανιάς": ["2020-5-13", "2021-12-17"],
        "Νίκος Κοτενίδης": ["2021-12-15"],
      },
      "Κόμησσα Αλμαβίβα": {
        "Τσέλια Κοστέα": ["2020-5-13", "2021-12-15"],
        "Χρύσα Μαλιαμάνη": ["2021-12-17"],
      },
      Σουζάννα: {
        "Αφροδίτη Πατουλίδου": ["2020-5-13", "2021-12-15"],
        "Μιράντα Μακρυνιώτη": ["2021-12-17"],
      },
      Φίγκαρο: {
        "Διονύσης Σούρμπης": ["2020-5-13", "2021-12-15"],
        "Δημήτρης Πλατανιάς": ["2021-12-17"],
      },
      Κερουμπίνο: {
        "Μιράντα Μακρυνιώτη": ["2021-12-17", "2021-12-15"],
        "Δημήτρης Πλατανιάς": ["2020-5-13"],
      },
      Μαρτσελλίνα: {
        "Μαρισία Παπαλεξίου ": ["2020-5-13", "2021-12-17"],
        "Χρύσα Μαλιαμάνη": ["2021-12-17"],
      },
      Μπάρτολο: {
        "Γιάννης Γιαννίσης": ["2020-5-13", "2021-12-15"],
        "Νίκος Κοτενίδης": ["2021-12-17"],
      },
      Μπαζίλιο: {
        "Χρήστος Κεχρής": ["2020-5-13", "2021-12-17"],
        "Δημήτρης Πλατανιάς": ["2021-12-15"],
      },
      Μπαζίλιο: {
        "Χρήστος Κεχρής": ["2020-5-13", "2021-12-15"],
        "Πέτρος Μαγουλάς": ["2021-12-17"],
      },
      "Ντον Κούρτσιο": {
        "Γιάννης Καλύβας": ["2020-5-13", "2021-12-15"],
        "Δημήτρης Πλατανιάς": ["2021-12-17"],
      },
      Μπαρμπαρίνα: {
        "Μαριλένα Στριφτόμπολα": ["2020-5-13", "2021-12-15"],
        "Άννα Στυλιανάκη": ["2021-12-17"],
      },
      Αντόνιο: {
        "Κωστής Ρασιδάκις": ["2020-5-13", "2021-12-15"],
        "Πέτρος Μαγουλάς": ["2021-12-17"],
      },
      Μουσικοί: {
        "Πέτρος Μαγουλάς": ["2021-12-15", "2021-12-17"],
        "Αλέξανδρος Σταυρακάκης": ["2020-5-13", "2021-12-15", "2021-12-17"],
        "Διονύσης Σούρμπης": ["2020-5-13", "2021-12-17"],
        "Νίκος Κοτενίδης": ["2020-5-13", "2021-12-15"],
      },
    },
  },

  "Madame Butterfly": {
    name: "Μαντάμα Μπαττερφλάι",
    composer: "Τζάκομο Πουτσίνι",
    libretto: "Λουίτζι Ίλικα και Τζουζέπε Τζακόζα",
    production: "Εθνική Λυρική Σκηνή",
    img_src: "newimg/repertoire3.jpg",
    description: `Η υπόθεση της όπερας αφορά τον μοιραίο έρωτα της δεκαπεντάχρονης γκέισας Τσο-Τσο-Σαν για τον Πίνκερτον, υποπλοίαρχο του Ναυτικού των Ηνωμένων Πολιτειών της Αμερικής. Ύστερα από τρία χρόνια απουσίας, ο αξιωματικός επιστρέφει με την Αμερικανίδα σύζυγό του στην Ιαπωνία, μαθαίνοντας ότι έχει αποκτήσει γιο από την Μπαττερφλάι. Εκείνη δέχεται να παραδώσει το παιδί μονάχα στον ίδιο τον Πίνκερτον και στη συνέχεια αυτοκτονεί. Διάσημη για τις υπέροχες άριες, την πρόδηλα μελωδική μουσική και τη δραματική θεατρικότητά της, η Μαντάμα Μπαττερφλάι συγκινεί διαχρονικά και προκαλεί έντονα συναισθήματα. Ο Πουτσίνι δεν διστάζει να τη χαρακτηρίσει ως την πιο αγαπημένη του όπερα, ενώ με τις μετέπειτα τροποποιήσεις ανάγει την αλαβάστρινη μορφή της ηρωίδας του σε σύμβολο ανεξάντλητης υπομονής και αιώνιας, σταθερής αγάπης. Τη σκηνοθεσία, τα σκηνικά και τα κοστούμια της παραγωγής, η οποία πρωτοπαρουσιάστηκε το 2013 στο Ηρώδειο, και τώρα αναβιώνει σε μια νέα εκδοχή για τη σκηνή της Αίθουσας Σταύρος Νιάρχος, υπογράφει ο διάσημος Αργεντινός σκηνοθέτης Ούγκο ντε Άνα. Πρόκειται για μια εντυπωσιακή παραγωγή με παραδοσιακά γιαπωνέζικα κοστούμια, ενώ τα σκηνικά και οι προβολές εικονοποιούν με εντυπωσιακό τρόπο τη χώρα του ανατέλλοντος ηλίου από τη μια και τον ψυχισμό της ηρωίδας από την άλλη. Τις προβολές υπογράφει ο Σέρτζιο Μετάλλι, ενώ τους φωτισμούς ο Βαλέριο Αλφιέρι.`,
    dates: [
      "2021-10-14",
      "2021-10-16",
      "2021-10-18",
      "2021-10-20",
      "2021-10-23",
      "2021-10-25",
      "2021-10-30",
      "2021-11-01",
      "2021-11-08",
      "2021-11-15",
    ],
    crew: {
      conductor: "Λουκάς Καρυτινός",
      director: "Ούγκο ντε Άνα",
      "video projection designer": "Σέρτζιο Μετάλλι - Ideogamma SRL",
      sets: "Ούγκο ντε Άνα",
      costumes: "Ούγκο ντε Άνα",
      "lighting designer": "Βαλέριο Αλφιέρι",
      "chorus master": "Αγαθάγγελος Γεωργακάτος",
    },
    roles: {
      "Τσο-Τσο-Σαν": {
        "Ερμονέλα Γιάχο": [
          "2021-10-14",
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
        ],
        "Τσέλια Κοστέα": ["2021-11-15"],
        "Κριστίνε Οπολάις": [
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-01",
          "2021-11-11",
        ],
      },
      Σουτζούκι: {
        "Χρυσάνθη Σπιτάδη": [
          "2021-10-14",
          "2021-10-16",
          "2021-10-18",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
          "2021-10-30",
          ,
          "2021-11-01",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      "Κέιτ Πίνκερτον": {
        "Βιολέττα Λούστα": [
          "2021-10-16",
          "2021-10-18",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
        ],
        "Διαμάντη Κριτσωτάκη": [
          "2021-10-14",
          "2021-10-30",
          "2021-11-01",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      "Μ.Φ.Πίνκερτον": {
        "Τζανλούκα Τερρανόβα": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
        ],
        "Δημήτρης Πακσόγλου": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-30",
          "2021-11-01",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      Σάρπλες: {
        "Διονύσης Σούρμπης": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
        ],
        "Νίκος Κοτενίδης": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-30",
          "2021-11-01",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      Γκόρο: {
        "Νίκος Στεφάνου": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
        ],
        "Γιάννης Καλύβας": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-30",
          "2021-11-01",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      "Πρίγκιπας Γιαμαντόρι": {
        "Μάριος Σαραντίδης": [],
      },
      Μπόνζο: {
        "Γιάννης Γιαννίσης": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-23",
          "2021-10-25",
          "2021-11-01",
        ],
        "Δημήτρης Κασιούμης": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-30",
          "2021-11-08",
          "2021-11-15",
        ],
      },
      Γιακουζιντέ: {
        "Πέτρος Σαλάτας": [],
      },
      "Αυτοκρατορικός Επίτροπος": {
        "Διονύσης Τσαντίνης": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
          "2021-11-01",
          "2021-11-15",
        ],
        "Γιώργος Παπαδημητρίου": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-08",
        ],
      },
      Ληξίαρχος: {
        "Θεόδωρος Αϊβαλιώτης": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
          "2021-11-01",
          "2021-11-15",
        ],
        "Θεόδωρος Μωραΐτης": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-08",
        ],
      },
      "Μητέρα της Τσο - Τσο - Σαν": {
        "Αμαλία Αυλωνίτη": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
          "2021-11-01",
          "2021-11-15",
        ],
        "Ζωή Απειρανθίτου": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-08",
        ],
      },
      Θεία: {
        "Βάγια Κωφού": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
          "2021-11-01",
          "2021-11-15",
        ],
        "Ελισάβετ Κλονόφσκαγια": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-08",
        ],
      },
      Ξαδέρφη: {
        "Φωτεινή Χατζιδάκη": [
          "2021-10-16",
          "2021-10-25",
          "2021-10-25",
          "2021-11-01",
          "2021-11-15",
        ],
        "Θέη Σταύρου": [
          "2021-10-14",
          "2021-10-18",
          "2021-10-23",
          "2021-10-30",
          "2021-11-08",
        ],
      },
    },
  },
};

var show_name = window.location.href.split("?")[1].replaceAll("%20", " ");
//console.log(show_name);

/* TITLE OF PAGE*/

page_title = document.querySelector("title");
page_title.innerHTML = shows[show_name]["name"] + " - Εθνική Λυρική Σκηνή";

/* TITLE of the show*/
show_title = document.querySelector(".title");
show_title.innerHTML = shows[show_name]["name"];

/* PHOTO*/
elem0 = document.querySelector(".photo");
elem0.style.backgroundImage = "url(" + shows[show_name]["img_src"] + ")";

var div0 = document.createElement("div");

elem0.append(div0);

/* SUNTHESI*/
elem7 = document.querySelector(".composer");
var div = document.createElement("div");

div.innerHTML = shows[show_name]["composer"];

/* LIBRETTO*/
elem7.append(div);

/* SUNTELESTES */
elem1 = document.querySelector(".syntelestes");

keys = Object.keys(shows[show_name]["crew"]);

for (i in keys) {
  var div2 = document.createElement("div");
  div2.classList.add("role-name");

  div2.innerHTML =
    shows[show_name]["crew"][keys[i]] +
    "&nbsp" +
    "<span class='role'>" +
    " " +
    [keys[i]] +
    "</span>";

  elem1.append(div2);
}

/* synopsis*/

elem4 = document.querySelector(".synopsis");
var div5 = document.createElement("div");
//div5.classList.add("important");
div5.innerHTML = shows[show_name]["description"];

elem4.append(div5);

/*hmeromhnies*/

elem3 = document.querySelector(".imerominies");

dates_list = shows[show_name]["dates"];

for (i of dates_list) {
  elem3.innerHTML += i + ",&nbsp&nbsp";
}

/* ACTORS */

show_roles = document.querySelector(".protagonists");

for (let [key, value] of Object.entries(shows[show_name]["roles"])) {
  var div = document.createElement("div");
  div.classList.add("show_roles");
  div.innerHTML = key;

  for (let [key2, value2] of Object.entries(value)) {
    var div1 = document.createElement("div");
    div1.innerHTML += key2 + " : "; //+ value2;
    for (i in value2) {
      div1.innerHTML += value2[i] + ", ";
    }

    div1.classList.add("mainactors");
    div.append(div1);
  }

  show_roles.append(div);
}

reservbtn = document.querySelector(".reservbtn");
reservbtn.onclick = function () {
  window.location.href =
    "reservationnew.html#" +
    window.location.href.replace(window.location.href.match(/.*\?/), "");
};
